In [9]:
import pandas as pd; 
df = pd.read_csv("archivos\\texto.csv"); # df = dataframe
df

   nombre    apellido  edad
0  andres   "narvaez"    21
1   karol    martinez    15
2   maria       yemey    17
3  camila       perez    20

In [8]:
#obteniendo todos los datos de la columna nombre
nombre = df['Name'] 
nombre

0    nombre
1    andres
2     karol
3     maria
4    camila
Name: Name, dtype: object

In [10]:
import pandas as pd;
#? parametro names redefinimos los encabezados de la tabla  
df = pd.read_csv("archivos\\texto.csv",names=["Name","LastName","Age"]); # df = dataframe
df

     Name    LastName   Age
0  nombre    apellido  edad
1  andres   "narvaez"    21
2   karol    martinez    15
3   maria       yemey    17
4  camila       perez    20